In [2]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [5]:
df3 = pd.merge(df1, df2)

In [6]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [7]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [151]:
ds1 = pd.DataFrame({'month_year':[201801, 201802, 201803, 201804], 'loan_type':['30ARM', '30ARM', '30ARM', '30ARM'], 'number_of_accounts':[1234567, 1234894, 1245123, 1244200], 'number_of_past_due_accounts':[2987, 2995, 2989, 2897], 'outstanding_balance':[1.533, 1.645, 1.785, 1.435]})

In [27]:
display('ds1')

,month_year,loan_type,number_of_accounts,number_of_past_due_accounts,outstanding_balance
0,201801,30ARM,1234567,2987,1.533
1,201802,30ARM,1234894,2995,1.645
2,201803,30ARM,1245123,2989,1.785
3,201804,30ARM,1244200,2897,1.435

In [26]:
ds2 = pd.DataFrame({'month_year':[201801, 201802, 201803, 201804], 'loan_type':['30ARM', '30ARM', '30ARM', '30ARM'], 'number_of_accounts':[1234567, 1234894, 1245100, 1244227], 'number_of_past_due_accounts':[2987, 2995, 2989, 2897], 'outstanding_balance':[1533256, 1645368, 1785258, 1435122]})

In [28]:
ds2

,month_year,loan_type,number_of_accounts,number_of_past_due_accounts,outstanding_balance
0,201801,30ARM,1234567,2987,1533256
1,201802,30ARM,1234894,2995,1645368
2,201803,30ARM,1245100,2989,1785258
3,201804,30ARM,1244227,2897,1435122

In [31]:
ds1.equals(ds2)

False

In [39]:
ds2['outstanding_balance'] = ds2['outstanding_balance'].astype(float)

In [42]:
ds2

,month_year,loan_type,number_of_accounts,number_of_past_due_accounts,outstanding_balance
0,201801,30ARM,1234567,2987,1533256.0
1,201802,30ARM,1234894,2995,1645368.0
2,201803,30ARM,1245100,2989,1785258.0
3,201804,30ARM,1244227,2897,1435122.0

In [64]:
ds3 = pd.merge(ds1, ds2, how='outer', on=['month_year', 'loan_type'])

In [65]:
ds3

,month_year,loan_type,number_of_accounts_x,number_of_past_due_accounts_x,outstanding_balance_x,number_of_accounts_y,number_of_past_due_accounts_y,outstanding_balance_y
0,201801,30ARM,1234567,2987,1.533,1234567,2987,1533256.0
1,201802,30ARM,1234894,2995,1.645,1234894,2995,1645368.0
2,201803,30ARM,1245123,2989,1.785,1245100,2989,1785258.0
3,201804,30ARM,1244200,2897,1.435,1244227,2897,1435122.0

In [153]:
# more comprehensive merge
#print(pd.merge(ds1, ds2, how='outer', left_index=True, right_index=True))
ds_merge = pd.merge(ds1, ds2, how='outer', left_index=True, right_index=True)
print(ds_merge)

   month_year_x loan_type_x  number_of_accounts_x  \
0        201801       30ARM               1234567
1        201802       30ARM               1234894
2        201803       30ARM               1245123
3        201804       30ARM               1244200

   number_of_past_due_accounts_x  outstanding_balance_x  month_year_y  \
0                           2987                  1.533        201801
1                           2995                  1.645        201802
2                           2989                  1.785        201803
3                           2897                  1.435        201804

  loan_type_y  number_of_accounts_y  number_of_past_due_accounts_y  \
0       30ARM               1234567                           2987
1       30ARM               1234894                           2995
2       30ARM               1245100                           2989
3       30ARM               1244227                           2897

   outstanding_balance_y
0              1533256.0
1              1645368.0
2              1785258.0
3              1435122.0

In [154]:
#shows values in rows from two data sets that are different for same columns 
def rows_with_diff_vals(df1, df2):
    # if there is any difference between ds1 and ds2 data sets, proceed with the
    # algorithm 
    if not ds1.equals(ds2):
        if df1.columns.tolist() != df2.columns.tolist():
            raise ValueError("data frames with different column names!")
        diff_val_cols = []
        for col in df1.columns:
            if not df1[col].equals(df2[col]):
                diff_val_cols.append(col)
        diff_cols_1 = df1[diff_val_cols]
        diff_cols_2 = df2[diff_val_cols]
        diff_rows = diff_cols_1.compare(diff_cols_2)
        return diff_rows

In [155]:
print(rows_with_diff_vals(ds1, ds2))

  number_of_accounts            outstanding_balance
                self      other                self      other
0                NaN        NaN               1.533  1533256.0
1                NaN        NaN               1.645  1645368.0
2          1245123.0  1245100.0               1.785  1785258.0
3          1244200.0  1244227.0               1.435  1435122.0

In [113]:
#diff_cols = cols_with_diff_vals(ds1, ds2)
#diff_cols.columns = ['number_of_accounts_ds1', 'outstanding_balance_ds1', 'number_of_accounts_ds2', 'outstanding_balance_ds2']
#print(diff_cols)

   number_of_accounts_ds1  outstanding_balance_ds1  number_of_accounts_ds2  \
0                 1234567                    1.533                 1234567
1                 1234894                    1.645                 1234894
2                 1245123                    1.785                 1245100
3                 1244200                    1.435                 1244227

   outstanding_balance_ds2
0                1533256.0
1                1645368.0
2                1785258.0
3                1435122.0

In [122]:
#diff_rows = diff_cols[(diff_cols['number_of_accounts_ds1'] != diff_cols['number_of_accounts_ds2'])]
#print(diff_rows)

   number_of_accounts_ds1  outstanding_balance_ds1  number_of_accounts_ds2  \
2                 1245123                    1.785                 1245100
3                 1244200                    1.435                 1244227

   outstanding_balance_ds2
2                1785258.0
3                1435122.0